/*
Задание 2.
Создать абстрактный родительский класс транспортное средство 
Transport. От него создать 3 производных класса (типы транспортных 
средств), при необходимости переопределить методы базового класса 
с применением метода super(). 
В классах использовать модификаторы (как в родительском классе, 
так и в производных), а также аксессоры. Создать от производных 
классов минимум по 2 экземпляра (модели транспортных средств). 
Методы в производных классах должны выводить на экран все 
свойства (описание автомобиля). Продумайте самостоятельно, 
какие свойства в производных классах должны быть public, 
какие – private и protected. Создайте массив транспортных 
средств и выведите их характеристики в цикле.
*/

class MyTransport {

}